import { LanguageInterface } from "./Language.interface";

export const dictionary: LanguageInterface.TLanguage = {
	GO_NEXT: {
		EN: "",
		RU: "Пройти в коридор",
	},
	LIGHT_ON: {
		EN: "",
		RU: "Включить свет",
	},
	GO_KITCHEN: {
		EN: "",
		RU: "Пойти на кухню",
	},
	GO_ROOM: {
		EN: "",
		RU: "Пойти к комнате",
	},
	DRINK: {
		EN: "",
		RU: "Выпить сок",
	},
	LISTEN: {
		EN: "",
		RU: "Прислушаться к голосам",
	},
	BACK: {
		EN: "",
		RU: "Вот как значит)",
	},
	GO_AND_SAY: {
		EN: "",
		RU: "Войти и сказать, что знайте, что тут люди!",
	},
	GO_AT_ONCE: {
		EN: "",
		RU: "Войти",
	},
	GO_SILIENCE: {
		EN: "",
		RU: "Войти, но не подавать виду, что знайте про сюрприз",
	},
	SURPRISED: {
		EN: "",
		RU: "Удивиться!",
	},
	SMILE: {
		EN: "",
		RU: "Улыбнуться",
	},
	GO_DAY_SELEBRITY: {
		EN: "",
		RU: "Праздновать!!",
	},
	FINAL: {
		EN: "",
		RU: "С днем рождения!",
	},
	THE_END: {
		EN: "",
		RU: "Поздравляю тебя! :3",
	},
	START_S: {
		EN: "",
		RU: "Уставшая после долгой учебы и тяжелой работы, Аля почти без сил возвращается поздно домой. Уже ночь и в коридоре почти что не возможно видеть дальше вытянутой руки.",
	},
	LIGHT_ERROR: {
		EN: "",
		RU: "'щелк', но ничего не произошло. Вероятно глупая лампочка перегорела. Нужно не забыть потом попросить кого-нибудь заменить ее...",
	},
	KORIDOR: {
		EN: "",
		RU: "Идти по коридору во тьме довольно сложно. Хорошо, что его помнят как свои пять пальцев, иначе было бы больно куда-нибудь врезаться.",
	},
	KITCHEN: {
		EN: "",
		RU: "Аля недолго думая решила направится на главное место в квартире. На кухню. Странно было то, что стола не было и кажется, что со стороны комнаты доносятся странные звуки...",
	},
	DRINK_S: {
		EN: "",
		RU: "Помня о том, что в холодильнике еще оставался какой то сок, Аля решила закончить начатое и допить его. Как бы удивительно это ни было, но пакет был как будто бесконечным и проиграв ему этот раунд, поставила его обратно",
	},
	LISTENER: {
		EN: "",
		RU: "Прислушавшись, хоть он и был очень тихий, Аля смогла разобрать голос. Он принадлежал ее другу. Вероятно они готовят сюрприз в ее комнате...",
	},
	ROOM: {
		EN: "",
		RU: "Собравшись с мыслями, Аля отправилась в сторону своей комнаты",
	},
	SURPRIS: {
		EN: "",
		RU: "'СЮРПРИЗ!!' из тьмы комнаты раздались громогласные поздравления знакомых и друзей!. Свет включился и стало возможно разглядеть долгие приготовления, что были сделаны заранее. Большая цифра 19. Стол, что взяли из кухни, большой торт и куча подарков, что покоятся на кровати",
	},
	GO_AND_SAY_S: {
		EN: "",
		RU: "Вы вошли, пытаясь разглядеть людей во тьме, вас ослепил свет, что сразу включили и спустя мгновения, крик 'ПОЧТИ СЮРПРИЗ' раздался со всех сторон. Стало возможно разглядеть долгие приготовления, что были сделаны заранее. Большая цифра 19. Стол, что взяли из кухни, большой торт и куча подарков, что покоятся на кровати",
	},
	VANDERFUL: {
		EN: "",
		RU: "Аля сильно удивилась этому сюрпризу, ведь откуда ей было знать, что такой масштаюный сюрприз готовится прямо у нее в комнате!",
	},
	SMILES: {
		EN: "",
		RU: "Аля улыбнулась своей лучезарной улыбкой. Хоть она уже и догадалась, когда была услышала на кухне знакомый голос, но это было всё равно приятно",
	},
	POZDRAVLENIA: {
		EN: "",
		RU: "Со всех сторон без очереди раздавались поздравления и пожелания! Почти ничего нельзя было расслышать, но это было и не важно. Глвное же внимание!",
	},
	FINAL_S: {
		EN: "",
		RU: "Поздравления были поздравлены, подарки подарены, алкоголь выпит, вазы разбиты. Праздник прошел так, как и должен проходить подобный праздник. С весельем, градусом с гитарой. Поздравляю тебя Аль и желаю найти всё то, что ищешь! (PS. Я делал эту штуку очень, очень долго и если ты не дойдешь до сюда, то я расстроюсь)",
	},
	GFH: {
		EN: "",
		RU: "",
	},
	GHJ: {
		EN: "",
		RU: "",
	},
	LFG: {
		EN: "",
		RU: "",
	},
	TES: {
		EN: "",
		RU: "",
	},
	TYU: {
		EN: "",
		RU: "",
	},
	ESD: {
		EN: "Day of Endless Darkness",
		RU: "День Бескрайней Темноты",
	},
	SHR: {
		EN: "Day of Shimmering Ridge",
		RU: "День Мерцающей Гряды",
	},
	MOS: {
		EN: "Day of Morning Star",
		RU: "День Утренней Звезды",
	},
	SHM: {
		EN: "Day of Shining Moon",
		RU: "День Сияющей Луны",
	},
	FLD: {
		EN: "Day of Flaming Dawn",
		RU: "День Пылающей Зари",
	},
	EXIT: {
		EN: "Exit",
		RU: "Выход",
	},
};
